load-tests/testReport.txt
All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 19:45:21(+0200)
--------------------------------

http.codes.201: ................................................................ 1000
http.downloaded_bytes: ......................................................... 0
http.request_rate: ............................................................. 429/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 15
  max: ......................................................................... 935
  mean: ........................................................................ 343.3
  median: ...................................................................... 361.5
  p95: ......................................................................... 632.8
  p99: ......................................................................... 772.9
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 1000
vusers.created: ................................................................ 1000
vusers.created_by_name.0: ...................................................... 1000
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 54.9
  max: ......................................................................... 1485
  mean: ........................................................................ 664.5
  median: ...................................................................... 685.5
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 1200.1